In [59]:
import pandas as pd

In [60]:
persons = {
    "first": "Ahmed",
    "last": "Akram",
    "email": "AAA3@sss.com"
}

In [61]:
people = {
    "first": ["Ahmed"] ,
    "last": ["Akram"],
    "email": ["AAA3@sss.com"]
}

In [62]:
people = {
    "first": ["Ahmed", "Ammar", "Ebrahim"],
    "last": ["Akram", "Mohamed", "Ali"],
    "email": ["AAA3@sss.com", "BBB4@sss.com", "CCC5@sss.vom"]
}

In [63]:
# Access a Key of Dictionary
people["email"]

['AAA3@sss.com', 'BBB4@sss.com', 'CCC5@sss.vom']

In [64]:
# Define a DataFrame
# Data Frame -> 2D Data Structure Like a Table of Rows and Columns
df = pd.DataFrame(people)

In [65]:
df

     first     last         email
0    Ahmed    Akram  AAA3@sss.com
1    Ammar  Mohamed  BBB4@sss.com
2  Ebrahim      Ali  CCC5@sss.vom

In [66]:
# Access a Single Column -> Return a Pandas Series
# 1st Way -> df["name of column"]
# 2nd Way -> df.column_name
df["first"]

0      Ahmed
1      Ammar
2    Ebrahim
Name: first, dtype: object

In [67]:
df.first

<bound method NDFrame.first of      first     last         email
0    Ahmed    Akram  AAA3@sss.com
1    Ammar  Mohamed  BBB4@sss.com
2  Ebrahim      Ali  CCC5@sss.vom>

In [68]:
df["last"]

0      Akram
1    Mohamed
2        Ali
Name: last, dtype: object

In [69]:
df.last

<bound method NDFrame.last of      first     last         email
0    Ahmed    Akram  AAA3@sss.com
1    Ammar  Mohamed  BBB4@sss.com
2  Ebrahim      Ali  CCC5@sss.vom>

In [70]:
df["email"]

0    AAA3@sss.com
1    BBB4@sss.com
2    CCC5@sss.vom
Name: email, dtype: object

In [71]:
df.email

0    AAA3@sss.com
1    BBB4@sss.com
2    CCC5@sss.vom
Name: email, dtype: object

In [72]:
type(df["email"]) # Series -> Like a Column [List of Data], 1D Data Structure

pandas.core.series.Series

In [73]:
# Access More Than 1 Column -> List of Columns
df[ ['last', 'first'] ]

      last    first
0    Akram    Ahmed
1  Mohamed    Ammar
2      Ali  Ebrahim

In [74]:
df[ ['first', 'email'] ]

     first         email
0    Ahmed  AAA3@sss.com
1    Ammar  BBB4@sss.com
2  Ebrahim  CCC5@sss.vom

In [75]:
# Get All Column names of DF
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [76]:
# loc vs. iloc
# iloc -> Access Rows by Index Integer Location
# df.iloc[ : ,  :] -> df.iloc[Rows , Columns]
df.iloc[0] # First Row

first           Ahmed
last            Akram
email    AAA3@sss.com
Name: 0, dtype: object

In [77]:
df.iloc[1] # Second Row

first           Ammar
last          Mohamed
email    BBB4@sss.com
Name: 1, dtype: object

In [78]:
df.iloc[[1]]

   first     last         email
1  Ammar  Mohamed  BBB4@sss.com

In [79]:
################################################## IMPORTANT
df.iloc[0:2] # First & Second Rows
# End is Not Included

   first     last         email
0  Ahmed    Akram  AAA3@sss.com
1  Ammar  Mohamed  BBB4@sss.com

In [80]:
df.iloc[[0, 1]]

   first     last         email
0  Ahmed    Akram  AAA3@sss.com
1  Ammar  Mohamed  BBB4@sss.com

In [81]:
df.iloc[:, 0] # Access First Column and All Rows

0      Ahmed
1      Ammar
2    Ebrahim
Name: first, dtype: object

In [82]:
df.iloc[:, 2] # Access Third Column and All Rows

0    AAA3@sss.com
1    BBB4@sss.com
2    CCC5@sss.vom
Name: email, dtype: object

In [83]:
df.iloc[[0, 1], 2] # Access 1st and 2nd Rows with Third Column

0    AAA3@sss.com
1    BBB4@sss.com
Name: email, dtype: object

In [84]:
df.iloc[0:2, 2] # Anthor Way

0    AAA3@sss.com
1    BBB4@sss.com
Name: email, dtype: object

In [85]:
# loc -> Location by Labels
df

     first     last         email
0    Ahmed    Akram  AAA3@sss.com
1    Ammar  Mohamed  BBB4@sss.com
2  Ebrahim      Ali  CCC5@sss.vom

In [86]:
# Row Labels -> 0, 1, 2
# Column Labels -> "first", "last", "email"

In [87]:
df.loc[0]

first           Ahmed
last            Akram
email    AAA3@sss.com
Name: 0, dtype: object

In [88]:
df.loc[[0,1]]

   first     last         email
0  Ahmed    Akram  AAA3@sss.com
1  Ammar  Mohamed  BBB4@sss.com

In [89]:
################################################## IMPORTANT
df.loc[0:1] # End is Included

   first     last         email
0  Ahmed    Akram  AAA3@sss.com
1  Ammar  Mohamed  BBB4@sss.com

In [90]:
df.loc[:, "email"]

0    AAA3@sss.com
1    BBB4@sss.com
2    CCC5@sss.vom
Name: email, dtype: object

In [91]:
df.loc[[0,1], "email"]

0    AAA3@sss.com
1    BBB4@sss.com
Name: email, dtype: object

In [92]:
df.loc[[0,1], ["email", "first"]]

          email  first
0  AAA3@sss.com  Ahmed
1  BBB4@sss.com  Ammar

In [93]:
df["Liked"] = ["Yes", "No", "No"]
df

     first     last         email Liked
0    Ahmed    Akram  AAA3@sss.com   Yes
1    Ammar  Mohamed  BBB4@sss.com    No
2  Ebrahim      Ali  CCC5@sss.vom    No

In [94]:
df["Liked"].value_counts() # Counter for each Unique Cell Value

No     2
Yes    1
Name: Liked, dtype: int64

In [95]:
df.loc[0, "Liked"] # Cell Value at  First Row and First Column

'Yes'

In [96]:
df.loc[[0, 2], "Liked"] # Cell Value at (First & Third) Rows and First Column

0    Yes
2     No
Name: Liked, dtype: object

In [97]:
df.loc[[0, 2], "Liked"] # Cell Value at (First & Third) Rows and First Column

0    Yes
2     No
Name: Liked, dtype: object

In [98]:
df.loc[0:2, "first":"email"]

     first     last         email
0    Ahmed    Akram  AAA3@sss.com
1    Ammar  Mohamed  BBB4@sss.com
2  Ebrahim      Ali  CCC5@sss.vom

In [99]:
df.columns

Index(['first', 'last', 'email', 'Liked'], dtype='object')

In [100]:
df.count()

first    3
last     3
email    3
Liked    3
dtype: int64